// SJDK - 09/02/22 - University of Regina

// !!!!! PLEASE READ THE COMMENTS BELOW !!!!!
// This is a template config file for running DEMPgen for EIC events, consult this file for the availble options
// DO NOT EDIT THIS FILE - It is used by the two shell scripts in this folder to automatically create a new config file with the conditions you want
// Either copy this file to a new name and edit it as you want OR just execute the shell scripts
// !!!!! PLEASE READ THE COMMENTS ABOVE !!!!!

{
    // This is an exmaple Json configuration file that will accept 
    // parameters for both EIC and Solid simulation.
    //Config
    // All values should use units of MeV for energies and momenta,
    // and degrees for angles.
    // n_events indicates number of attempts
    // "experiment" : "eic" or "solid"
    "experiment" : "eic",

    "file_name" : "DEMPgen_EIC_test",
    "n_events" : 100000000,
    "generator_seed": 1234567,

    //**************************************
    /// This section if for EIC simulation only
    "Kinematics_type" : 1,         // Kinematics type (1->FF, 2->TSSA)
    "ROOTOut": "true",             // Enable or disable root file output, true or false
    "ejectile": "Pion+", 		   // Choices: omega, pi+, pi0, K+
    "recoil_hadron": "neutron",                // Choices: Neutron, proton, Lambda or Sigma0
    "ebeam": 5,                         // Electron beam energy in GeV
    "hbeam": 100,                        // Hadron beam energy in GeV
    "hbeam_part":"Proton",           // Hadron beam particle, proton, deut or helium3, work in progress, will need to be added to shell script later on as an argument
    "OutputType": "HEPMC3",		   // choices: LUND (Docker), Pythia6 (ECCE Fun4All) or HEPMC3 (ePIC)   
    "det_location": "ip6",		   // choices: ip6 for STAR, ip8 for PHENIX
    "calc_method": "Analytical",            // choices: Analytical or Solve, affects how the ejectile/recoil hadron 4-vectors are calculated. Default is analytical
    "Ee_Low": 0.5, // The minimum scattered electron energy that will be generated as a fraction of the electron beam energy
    "Ee_High": 2.5, // The maximum scattered electron energy that will be generated as a fraction of the electron beam energy
    "e_Theta_Low": 60.0, // The minimum scattered electron angle (theta) that will be generated in degrees
    "e_Theta_High": 175.0, // The maximum scattered electron angle (theta) that will be generated in degrees
    "EjectileX_Theta_Low": 0.0, // The minimum ejectile angle (theta) that will be generated in degrees
    "EjectileX_Theta_High": 100.0, // The maximum ejectile angle (theta) that will be generated in degrees
}
